CSI API ETABS v1
cGridSys.GetGridSysCylindrical Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGridSysCylindrical(
	string Name,
	ref double Xo,
	ref double Yo,
	ref double RZ,
	ref bool StoryRangeIsDefault,
	ref string TopStory,
	ref string BottomStory,
	ref double BubbleSize,
	ref int GridColor,
	ref int NumRLines,
	ref string[] GridLineIDR,
	ref double[] OrdinateR,
	ref bool[] VisibleR,
	ref string[] BubbleLocR,
	ref int NumTLines,
	ref string[] GridLineIDT,
	ref double[] OrdinateT,
	ref bool[] VisibleT,
	ref string[] BubbleLocT
)
Function GetGridSysCylindrical (
	Name As String,
	ByRef Xo As Double,
	ByRef Yo As Double,
	ByRef RZ As Double,
	ByRef StoryRangeIsDefault As Boolean,
	ByRef TopStory As String,
	ByRef BottomStory As String,
	ByRef BubbleSize As Double,
	ByRef GridColor As Integer,
	ByRef NumRLines As Integer,
	ByRef GridLineIDR As String(),
	ByRef OrdinateR As Double(),
	ByRef VisibleR As Boolean(),
	ByRef BubbleLocR As String(),
	ByRef NumTLines As Integer,
	ByRef GridLineIDT As String(),
	ByRef OrdinateT As Double(),
	ByRef VisibleT As Boolean(),
	ByRef BubbleLocT As String()
) As Integer
Dim instance As cGridSys
Dim Name As String
Dim Xo As Double
Dim Yo As Double
Dim RZ As Double
Dim StoryRangeIsDefault As Boolean
Dim TopStory As String
Dim BottomStory As String
Dim BubbleSize As Double
Dim GridColor As Integer
Dim NumRLines As Integer
Dim GridLineIDR As String()
Dim OrdinateR As Double()
Dim VisibleR As Boolean()
Dim BubbleLocR As String()
Dim NumTLines As Integer
Dim GridLineIDT As String()
Dim OrdinateT As Double()
Dim VisibleT As Boolean()
Dim BubbleLocT As String()
Dim returnValue As Integer
returnValue = instance.GetGridSysCylindrical(Name,
	Xo, Yo, RZ, StoryRangeIsDefault, TopStory,
	BottomStory, BubbleSize, GridColor,
	NumRLines, GridLineIDR, OrdinateR,
	VisibleR, BubbleLocR, NumTLines,
	GridLineIDT, OrdinateT, VisibleT,
	BubbleLocT)
int GetGridSysCylindrical(
	String^ Name,
	double% Xo,
	double% Yo,
	double% RZ,
	bool% StoryRangeIsDefault,
	String^% TopStory,
	String^% BottomStory,
	double% BubbleSize,
	int% GridColor,
	int% NumRLines,
	array<String^>^% GridLineIDR,
	array<double>^% OrdinateR,
	array<bool>^% VisibleR,
	array<String^>^% BubbleLocR,
	int% NumTLines,
	array<String^>^% GridLineIDT,
	array<double>^% OrdinateT,
	array<bool>^% VisibleT,
	array<String^>^% BubbleLocT
)
abstract GetGridSysCylindrical :
        Name : string *
        Xo : float byref *
        Yo : float byref *
        RZ : float byref *
        StoryRangeIsDefault : bool byref *
        TopStory : string byref *
        BottomStory : string byref *
        BubbleSize : float byref *
        GridColor : int byref *
        NumRLines : int byref *
        GridLineIDR : string[] byref *
        OrdinateR : float[] byref *
        VisibleR : bool[] byref *
        BubbleLocR : string[] byref *
        NumTLines : int byref *
        GridLineIDT : string[] byref *
        OrdinateT : float[] byref *
        VisibleT : bool[] byref *
        BubbleLocT : string[] byref -> int
Parameters
Name
Type: System.String
Xo
Type: System.Double
Yo
Type: System.Double
RZ
Type: System.Double
StoryRangeIsDefault
Type: System.Boolean
TopStory
Type: System.String
BottomStory
Type: System.String
BubbleSize
Type: System.Double
GridColor
Type: System.Int32
NumRLines
Type: System.Int32
GridLineIDR
Type: System.String[]
OrdinateR
Type: System.Double[]
VisibleR
Type: System.Boolean[]
BubbleLocR
Type: System.String[]
NumTLines
Type: System.Int32
GridLineIDT
Type: System.String[]
OrdinateT
Type: System.Double[]
VisibleT
Type: System.Boolean[]
BubbleLocT
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cGridSys Interface
ETABSv1 Namespace